W14D5/app/models/user.rb

    def self.find_by_credentials(uname, pwd)
       user = User.find_by(username: uname )
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "anshu"], ["LIMIT", 1]]

   def reset_session_token!
    self.session_token = SecureRandom::urlsafe_base64;
    self.save
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "u3dWVTNJcBLTvO4wWIeuQQ"], ["updated_at", "2019-07-25 23:39:48.339876"], ["id", 37]]